# HOROSCOPE_MESSAGES = [
#     "Сьогодні вам буде супроводжувати удача, тому не бійтеся ризикувати і пробувати щось нове.",
#     "Зірки радять вам бути обережними з фінансами, але не варто відмовлятися від можливості заробити більше.",
#     "Сьогодні ви можете зустріти людину, яка змінить ваше життя на краще, тому будьте відкритими до нових знайомств.",
#     "Зірки рекомендують вам зайнятися спортом або фізичною активністю, щоб покращити своє здоров'я та настрій.",
#     "Сьогодні вам може знадобитися підтримка близьких людей, тому не соромтеся звертатися за допомогою.",
# ]

# Заготівля для першої пропозиції
FIRST = [
    "Сьогодні — ідеальний день для нових починань.",
    "Оптимальний день для того, щоб зважитися на сміливий вчинок!",
    "Будьте обережні, сьогодні зірки можуть вплинути на ваш фінансовий стан.",
    "Кращий час для того, щоб почати нові відносини або розібратися зі старими.",
    "Плідний день для того, щоб розібратися з справами, що накопичилися.",
]
SECOND = [
    "Але пам'ятайте, що навіть у цьому випадку потрібно не забувати про",
    "Якщо поїдете за місто, заздалегідь подумайте про",
    "Ті, хто сьогодні націлений виконати безліч справ, повинні пам'ятати про",
    "Якщо у вас занепад сил, зверніть увагу на",
    "Пам'ятайте, що думки матеріальні, а значить вам протягом дня потрібно постійно думати про",
]
SECOND_ADD = [
    "відносини з друзями та близькими.",
    "роботу і ділові питання, які можуть так недоречно завадити планам.",
    "себе і своє здоров'я, інакше до вечора можливий повний роздрай.",
    "побутові питання - особливо ті, які ви не доробили вчора."
    "відпочинок, щоб не перетворити себе на загнаного коня наприкінці місяця.",
]
THIRD = [
    "Злі язики можуть говорити вам протилежне, але сьогодні їх слухати не потрібно.",
    "Знайте, що успіх благоволить тільки наполегливим, тому присвятіть цей день вихованню духу.",
    "Навіть якщо ви не зможете зменшити вплив ретроградного Меркурія, то хоча б доведіть справи до кінця.",
    "Не треба боятися одиноких зустрічей — сьогодні той самий час, коли вони багато визначають.",
    "Якщо зустрінете незнайомця на шляху - проявите участь, і тоді ця зустріч пообіцяє вам приємний клопіт.",
]